[
  {
    "title": "1",
    "order": "1",
    "name": "Perfection",
    "overlay": "left",
    "subhead": "Aug. 15, 2012",
    "image": "felix1.jpg",
    "chatter": "On a sun-soaked Wednesday afternoon at then-Safeco Field, Hernandez stepped to the mound to make his 25th start in another season where the Mariners’ playoff hopes had ended before the All-Star break. He felt good, not great, in the bullpen. Twenty-seven outs later, he would feel perfect. Hernandez recorded the 23rd perfect game in MLB history and the first in Mariners franchise history in Seattle’s 1-0 victory.\n<p>\nBesides not allowing a baserunner, he struck out 13 batters. Of his 113 pitches, 77 were strikes including 24 swings and misses. It almost ended before it started when Sam Fuld, the first hitter of the game, hit a lower liner to right field that was caught by Eric Thames on a tough catch. Hernandez struck out eight of the last 12 batters he faced, including Sean Rodriguez looking for the final out despite falling behind 2-0.\n<p>“My mind was just throw it over the plate,” Hernandez said. “He's going to swing. He took it, and it was a strike. It's crazy.\"",
    "credit": "Mark Harrison / The Seattle Times",
    "youtube": "H-zFYjB5Tos",
    "link": ""
  },
  {
    "title": "2",
    "order": "2",
    "name": "Cy Young",
    "overlay": "left",
    "subhead": "Nov. 18, 2010",
    "image": "felix2.jpg",
    "chatter": "Hernandez helped changed the perception of pitcher success — particularly wins and losses — when he was named the 2010 American League Cy Young Award winner in a decisive selection process that saw him earn 21 first place votes with David Price getting four. His 13-12 record didn’t prove to be a deterrent like it might have been even five years earlier. He became the first pitcher to win the Cy Young with fewer than 15 wins. Beyond the record, which was largely affected by one of the many mediocre-to-terrible teams Hernandez played on for the bulk of his career, he still led the American League in earned run average (2.27), innings pitched (249 2/3) and quality starts (30). His 232 strikeouts and six complete games were second highest in the AL. He joined Randy Johnson as the only other Mariners player to win the award.\n<p>\n\"I don't have any words to explain how I feel,\" he said. \"I mean, you cannot explain it. The first time I heard I won the Cy Young, my mind was, 'Really? Really?' And I just asked one more time 'I won the Cy Young?' And they said, 'Yes, you won the Cy Young.'”",
    "credit": "Mike Siegel / The Seattle Times",
    "youtube": "TkO5sC-SPik",
    "link": "http://old.seattletimes.com/html/larrystone/2013469586_stone19.html"
  },
  {
    "title": "3",
    "order": "3",
    "name": "Extension and emotion",
    "overlay": "left",
    "subhead": "Feb. 8, 2013",
    "image": "felix3.jpg",
    "chatter": "The news had broken the day before, but the official announcement came on Feb. 12, 2013, at Safeco Field. Hernandez would remain a Mariner for the next seven years with a $175 million contract extension, making him then the highest paid pitcher in baseball. The scene at Safeco was emotional. When Hernandez and his wife, Sandra, stepped out of the elevator at the basement level for the news conference, he was met first by cheers. Nearly every Mariners employee in the building was clad in King’s Court T-shirts chanting and cheering his name. Tears streamed down his cheeks. There would be more tears in a heartfelt press conference where he pledged his loyalty to the only organization and fans he’d ever known.\n<p>\n\"I'm doing this because I love Seattle,\" Hernandez said. \"This has been my life. This has been my family.\"",
    "credit": "John Lok / The Seattle Times",
    "youtube": "TkO5sC-SPik",
    "link": "http://old.seattletimes.com/html/jerrybrewer/2020353081_brewer14.html"
  },
  {
    "title": "4",
    "order": "4",
    "name": "What could've been",
    "overlay": "right",
    "subhead": "Sept. 28, 2014",
    "image": "felix4.jpg",
    "chatter": "On the final day of the 2014 season, Hernandez walked to the mound at Safeco knowing that his team couldn’t lose. The Mariners had a slim chance to force a play-in game for the second wild card spot if the Oakland A’s lost and they beat the Angels. With losing not an option, Hernandez dominated until elimination. He pitched five shutout innings, allowing one hit with seven strikeouts. He took the mound for the sixth inning, knowing it would be another postseason spent at home. He pitched to one batter before being removed and receiving a standing ovation.\n<p>\n“You saw my face when I was pitching today,” Hernandez said. “This was it. This was my game.”",
    "credit": "Dean Rutz / The Seattle Times",
    "youtube": "byD6sy85v9I",
    "link": "https://www.seattletimes.com/sports/mariners/mariners-felix-hernandez-win-finale-but-eliminated-from-playoff-contention/"
  },
  {
    "title": "5",
    "order": "5",
    "name": "Remember the King",
    "overlay": "right",
    "subhead": "April 11, 2007",
    "image": "felix5.jpg",
    "chatter": "The buildup wasn’t about Hernandez, but the pitcher that would start for Boston this night in his Fenway Park debut. Daisuke Matsuzaka was the latest and most hyped Japanese pitcher to come to MLB. Boston won a bidding war for his services, paying $51.11 million for the rights to the 26-year-old right-hander and a six-year, $52 million contract. He would face Ichiro in the first at-bat of the game. But Hernandez, three days after his 21st birthday, became the story in the end. He tossed a one-hit shutout, allowing just one hit with two walks and six strikeouts. That one hit came in the eighth inning on a single by J.D. Drew.\n<p>\n\"He had everything going on tonight,” said Red Sox DH David Ortiz. “He was just impossible.\" ",
    "credit": "Charles Krupa / Associated Press",
    "youtube": "RVGuhoyQszk",
    "link": "https://www.seattletimes.com/sports/felix-hernandez-king-for-a-day/"
  },
  {
    "title": "6",
    "order": "6",
    "name": "Grand Salami",
    "overlay": "right",
    "subhead": "June 23, 2008",
    "image": "felix6.jpg",
    "chatter": "On June 23, 2008, Felix Hernandez became the first American League pitcher to hit a grand slam in a 37-year span when he smacked a first-pitch fastball off of Johan Santana over the wall in right field. The last AL pitcher to hit a grand slam was Cleveland’s Steve Dunning off the A’s Diego Segui on May 11, 1971, according to the Elias Sports Bureau. To Hernandez, this would definitely be a Top 5 moment. He will often remind people about it.\n<p>\n“My approach? Just swing,” Hernandez said.",
    "credit": "Seth Wenig / Associated Press",
    "youtube": "hi0UNUqnPBM",
    "link": "https://www.seattletimes.com/sports/mariners/felix-hernandez-hits-first-grand-slam-by-al-pitcher-in-37-years/"
  }
]